---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReinEstBarLength
source: html/06c4953f-58c1-a57e-abda-6260991794b9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReinEstBarLength Property

"Estimated Total Bar Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ReinEstBarLength { get; }
```